L = [1, 2, 3] 
a = L + L
L.append(4)
L.extend[5, 2, 3, 5] 
L.remove - удаление 
L.pop() - удаление по индексу если нет индекса последний элемент\
L.index() - узнать индекс
L.sort
L.reverse
new_L = L.copy()  вложеные списки хуево копируются 
L.clear  

tuple НЕИЗМЕНЯЕМЫЙ список кортеж
t = (1, 2, 3, 4, 5, 6)
t.__sizeof__()
L.__sizeof__() размер занимаемый объектом 
нельзя изменять сам кортеж, но можно изменять элементы списка если список является элементом кортежа 

dict словари - неупорядоченный набор ключей и значений 
ключи - неизменяемый тип данных 
слова - похуй что 
d = {'a': 100, 'b': 200}
d
{'a': 100, 'b': 200}
d  = dict(a=100, b=200)
d = 
множества set и frozenset

